'''
Вводим через запятую список слов. Формируем из этого списка множество.
Выводим на экран, сколько слов в этом списке с просьбой сформировать 2-ой список с таким же количеством символов.
После этого делаем словарь из этих двух массивов, где 1-й - ключи, 2-ой - значения.
Выводим этот словарь.
'''

list1 = input("введите список слов через запятую: ")
list1 = list1.split(",")
list_duplicate1 = set(list1)  # множество из 1 списка
count1 = len(list1)
print("в списке {} слов".format(count1))
list2 = input("ведите 2 список из {} слов через запятую: ".format(count1))
list2 = list2.split(",")
list_duplicate2 = set(list2)  # множество из 2 списка
dictionary = dict(zip(list1, list2))
print(dictionary)
